app/views/reportes/_reporte.html.haml

INSERT INTO "reportes" ("nombre", "created_at", "updated_at", "fono", "confirmado") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "jjjjjj"], ["created_at", "2025-05-12 11:58:31.735404"], ["updated_at", "2025-05-12 11:58:31.735404"], ["fono", "56"], ["confirmado", false]]
---
    %p
      Publicado en #{time_tag( reporte.created_at)}

SELECT COUNT(*) FROM "comentarios" WHERE "comentarios"."reporte_id" = $1  [["reporte_id", 78]]
---
    %p
      %strong= pluralize reporte.comentarios.count, "comentarios"