app/controllers/reportes_controller.rb

SELECT "reportes".* FROM "reportes" ORDER BY "reportes"."id" DESC
---
  def index
    @reportes = Reporte.all

INSERT INTO "reportes" ("nombre", "created_at", "updated_at", "fono", "confirmado") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "otro"], ["created_at", "2025-05-12 11:03:26.978020"], ["updated_at", "2025-05-12 11:03:26.978020"], ["fono", ""], ["confirmado", false]]
---
  def create
    @reporte = Reporte.new(reporte_params)

    respond_to do |format|
      if @reporte.save

UPDATE "reportes" SET "nombre" = $1, "contenido" = $2, "updated_at" = $3, "fono" = $4 WHERE "reportes"."id" = $5  [["nombre", "88"], ["contenido", "88"], ["updated_at", "2025-05-13 10:04:01.456688"], ["fono", "88"], ["id", 145]]
---
  def update
    respond_to do |format|
      if @reporte.update(reporte_params)

DELETE FROM "reportes" WHERE "reportes"."id" = $1  [["id", 115]]
---
  def destroy
    @reporte.destroy

SELECT "reportes".* FROM "reportes" WHERE "reportes"."id" = $1 LIMIT $2  [["id", 115], ["LIMIT", 1]]
---
    def set_reporte
      begin
        @reporte = Reporte.find(params[:id])